frontend/views/layouts/main.php

    } else {
            $menuItems[] = ['label' => 'Twittah', 'url' => 'https://www.twitter.com'];
            $menuItems[] = ['label' => 'Posts', 'url' => ['/posts/index']];
            $menuItems[] = [
            'label' => 'Logout (' . Yii::$app->user->identity->profile->first_name . ')',
            'url' => ['/site/logout'],
            'linkOptions' => ['data-method' => 'post']
        ];
---
SELECT * FROM `profile` WHERE `user_id`=1